meeting/minutes/2025/11-18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 142 Minutes 2025-11-18</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 142 Minutes 2025-11-18</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/4]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[9/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[0/2]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#close-without-action">1.6.3. Close without action</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2246">2.1. PR #2246: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()</a></li>
<li><a href="#pr-2295">2.2. PR #2295: 2294 Clarify semantics of `element(N, xs:anyType)`</a></li>
<li><a href="#pr-2289">2.3. PR #2289: 2195 (partial) Editorial notes (incremental)</a></li>
<li><a href="#pr-2286">2.4. PR #2286: 2279 fn:string-length#1, fn:normalize-space#1: accept xs:anyAtomicType</a></li>
<li><a href="#pr-2285">2.5. PR #2285: 2198 Add pi-for-cdata parameter</a></li>
<li><a href="#pr-2282">2.6. PR #2282: 2278 Add function bin:infer-encoding; simplify bin:decode-string</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-140-02: MK to add a note about dealing with binary in parse-csv and parse-json</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-141-01: MK to follow up on a comment by JWL on #2269</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-142-01: MK to review the “Captured Groups within Lookahead” example.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-142-02: MK to add explanatory note about the difference between typed an untyped values in string-length</li>
</ul>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[9/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: EP
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="off"><code>[&#xa0;]</code> Ed Porter (EP)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2025/11-18.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2025/11-11.html">the minutes of the previous meeting</a>. 
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 25 November 2025.
</p>

<p>
Regrets: EP, JLO
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-140-02: MK to add a note about dealing with binary in parse-csv and parse-json</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-141-01: MK to follow up on a comment by JWL on #2269</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2256">#2256</a>: 2216 All atomic types become ordered</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2293">#2293</a>: Updated RELAX NG grammar for XSLT 4.0 stylesheets</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2290">#2290</a>: Updated schema for XSLT 4.0 stylesheets</li>
</ul>

<p>
Proposal: accept without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
