meeting/minutes/2025/11-18.org
*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2252][#2252]]: Dynamic XPath Evaluation the functional way
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1618][#1618]]: Adaptive serialization: doubles

+ JWL: Discussion of #2252 just sort of tailed off…
+ MK: Yes, I thought we should drop it not because it isn’t doable, but to limit our ambitions.
+ JLO: I think it would be good to have such a function because almost all
  XQuery implementations I know already have that function.
+ CG: I have concerns that it may be too implementation-specific as it revolves
  around optimizing code. I think there were two proposals in this discussion.
  + One was a compiled instance that you could reuse,
  + The other was to compile a string into a function item.
+ MK: Let’s leave #2252 open for the moment then.
+ CG: I think there have been other discussions about evaluating XPath
  + This is more about optimizing
+ MK: This is primarily about the functionality.

Proposal: close #1618 with no further action.

Accepted.

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2246: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()
:PROPERTIES:
:CUSTOM_ID: pr-2246
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2246][#2246]]

+ MK: Now that regular expressions can match a zero length string, you can find
  all the word boundaries in an input string. The ~fn:regex-group~ function
  turns out to be somewhat inadequate; it returns the string but not where it
  found it.
  + … This proposes a ~fn:regex-groups~ function that returns the string and the matches.
  + … There are now “string segments” that are a combination of a substring and
    its position in the input.
  + … We now operate on a non-overlapping sequence of segments.
  + … Within a matching substring, you can access the groups.
  + … This distinguishes between matches on zero length strings and failure to match
  + … The ~fn:regex-group~ function is defined in terms of the new function, for
    backwards compatibility.
+ JWL: I’d be interested in a comparison between this and the ~fn:analyze-string~
  function that produces the same sort of output.
  + … Is there something to be said here about where one might be preferable?
+ MK: I think we enhanced ~fn:analyze-string~ function to account for zero-length string matches.
  + … But I’m not sure it does it quite as well.
+ JWL: In one case you get a map and in another you get elements. Might be worth
  saying something here.
+ JK: I think this is really nice. The definition says that the string segments
  are non-overlapping. What about look-ahead groups?
+ MK: The groups can overlap, but the matched segments don’t.
+ JK: In the example, there are two cyan colored ones. In the first one, I don’t
  understand the select.
+ MK: Yes…that is clearly gone wrong somewhere.

ACTION QT4CG-142-01: MK to review the “Captured Groups within Lookahead” example.

Proposal: Accept this PR.

Accepted.

** PR #2295: 2294 Clarify semantics of `element(N, xs:anyType)`
:PROPERTIES:
:CUSTOM_ID: pr-2295
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2295][#2295]]

+ MK: This is purely editorial and it’s a bug fix, because anyType is a supertype of untyped.
  + And an attempt to clarify a few things.
+ JLO: What is the test of ~xs:anyType~ (without the question mark)?
+ MK: That matches anything that hasn’t been nilled.
+ JLO: What would ~xs:untyped?~ mean?
+ MK: It’s allowed by the grammar but it doesn’t effect the meaning because an
  untyped thing can never be nilled.

Proposal: Accept this PR.

Accepted.

** PR #2289: 2195 (partial) Editorial notes (incremental)
:PROPERTIES:
:CUSTOM_ID: pr-2289
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2289][#2289]]

+ MK: In Safari the arrows look horrible. The arrows are very different.
+ CG: I’ll take another look at the arrows.
+ CG: But there are some other changes:
  + There’s some changes to the summary of changes text.
+ MK: That’s all fine.
+ CG: Some of the examples in the binary module didn’t work for me so I made a
  few changes.
  + … Mostly it’s about changing formatting.
+ CG: I think the code snippet for bin:shift is still buggy, but I can try to fix it.
+ JWL: If the arrows are sufficiently variable across the browser, should we
  make them images.

** PR #2286: 2279 fn:string-length#1, fn:normalize-space#1: accept xs:anyAtomicType
:PROPERTIES:
:CUSTOM_ID: pr-2286
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2286][#2286]]

+ CG: There has been a lot of discussion. Liam noted that ~string-length()~ and
  ~string-length(.)~ do different things.
  + … Without an argument, the context item is “stringified”.
  + … But with an argument, it can only take strings.
+ CG: But because of typed nodes, this not as easy as I thought.
+ CG: We could make the item type ~xs:anyAtomicType~ instead of ~xs:string~.
  + … With this change, string length and normalize space would be similar to
    other functions that accept the context item as the first item.
+ JLO: I’m in favor. I think there’s a slight chance of misalignment because ~.~
  could be an array. Don’t they get atomized?
  + … But ~xs:anyAtomicType~ doesn’t allow that.
+ CG: Arrays are going to be atomized. If that produces more than one string,
  then you’ll get an error. I don’t think that changes.
+ JLO: I can pass that in even with ~xs:anyAtomicType~?
+ MK: Yes, I think so.
+ JLO: Why is that in string length?
+ MK: That’s for typed nodes. If you pass in a name surrounded by spaces, the
  current spec (since XPath 2.0) says that the string length is the length of
  the string value of the node not the typed value. Those can be different.
  + … We’re retaining that compatibility.

Proposal: Accept this PR.

Accepted.

ACTION QT4CG-142-02: MK to add explanatory note about the difference between typed an untyped values in string-length

