meeting/minutes/2025/11-18.html
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2252">#2252</a>: Dynamic XPath Evaluation the functional way</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1618">#1618</a>: Adaptive serialization: doubles</li>

<li>JWL: Discussion of #2252 just sort of tailed off…</li>
<li>MK: Yes, I thought we should drop it not because it isn’t doable, but to limit our ambitions.</li>
<li>JLO: I think it would be good to have such a function because almost all
XQuery implementations I know already have that function.</li>
<li>CG: I have concerns that it may be too implementation-specific as it revolves
around optimizing code. I think there were two proposals in this discussion.
<ul class="org-ul">
<li>One was a compiled instance that you could reuse,</li>
<li>The other was to compile a string into a function item.</li>
</ul></li>
<li>MK: Let’s leave #2252 open for the moment then.</li>
<li>CG: I think there have been other discussions about evaluating XPath
<ul class="org-ul">
<li>This is more about optimizing</li>
</ul></li>
<li>MK: This is primarily about the functionality.</li>
</ul>

<p>
Proposal: close #1618 with no further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2246" class="outline-3">
<h3 id="pr-2246"><span class="section-number-3">2.1.</span> PR #2246: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()</h3>
<div class="outline-text-3" id="text-pr-2246">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2246">#2246</a>
</p>

<ul class="org-ul">
<li>MK: Now that regular expressions can match a zero length string, you can find
all the word boundaries in an input string. The <code>fn:regex-group</code> function
turns out to be somewhat inadequate; it returns the string but not where it
found it.
<ul class="org-ul">
<li>… This proposes a <code>fn:regex-groups</code> function that returns the string and the matches.</li>
<li>… There are now “string segments” that are a combination of a substring and
its position in the input.</li>
<li>… We now operate on a non-overlapping sequence of segments.</li>
<li>… Within a matching substring, you can access the groups.</li>
<li>… This distinguishes between matches on zero length strings and failure to match</li>
<li>… The <code>fn:regex-group</code> function is defined in terms of the new function, for
backwards compatibility.</li>
</ul></li>
<li>JWL: I’d be interested in a comparison between this and the <code>fn:analyze-string</code>
function that produces the same sort of output.
<ul class="org-ul">
<li>… Is there something to be said here about where one might be preferable?</li>
</ul></li>
<li>MK: I think we enhanced <code>fn:analyze-string</code> function to account for zero-length string matches.
<ul class="org-ul">
<li>… But I’m not sure it does it quite as well.</li>
</ul></li>
<li>JWL: In one case you get a map and in another you get elements. Might be worth
saying something here.</li>
<li>JK: I think this is really nice. The definition says that the string segments
are non-overlapping. What about look-ahead groups?</li>
<li>MK: The groups can overlap, but the matched segments don’t.</li>
<li>JK: In the example, there are two cyan colored ones. In the first one, I don’t
understand the select.</li>
<li>MK: Yes…that is clearly gone wrong somewhere.</li>
</ul>

<p>
ACTION QT4CG-142-01: MK to review the “Captured Groups within Lookahead” example.
</p>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2295" class="outline-3">
<h3 id="pr-2295"><span class="section-number-3">2.2.</span> PR #2295: 2294 Clarify semantics of `element(N, xs:anyType)`</h3>
<div class="outline-text-3" id="text-pr-2295">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2295">#2295</a>
</p>

<ul class="org-ul">
<li>MK: This is purely editorial and it’s a bug fix, because anyType is a supertype of untyped.
<ul class="org-ul">
<li>And an attempt to clarify a few things.</li>
</ul></li>
<li>JLO: What is the test of <code>xs:anyType</code> (without the question mark)?</li>
<li>MK: That matches anything that hasn’t been nilled.</li>
<li>JLO: What would <code>xs:untyped?</code> mean?</li>
<li>MK: It’s allowed by the grammar but it doesn’t effect the meaning because an
untyped thing can never be nilled.</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2289" class="outline-3">
<h3 id="pr-2289"><span class="section-number-3">2.3.</span> PR #2289: 2195 (partial) Editorial notes (incremental)</h3>
<div class="outline-text-3" id="text-pr-2289">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2289">#2289</a>
</p>

<ul class="org-ul">
<li>MK: In Safari the arrows look horrible. The arrows are very different.</li>
<li>CG: I’ll take another look at the arrows.</li>
<li>CG: But there are some other changes:
<ul class="org-ul">
<li>There’s some changes to the summary of changes text.</li>
</ul></li>
<li>MK: That’s all fine.</li>
<li>CG: Some of the examples in the binary module didn’t work for me so I made a
few changes.
<ul class="org-ul">
<li>… Mostly it’s about changing formatting.</li>
</ul></li>
<li>CG: I think the code snippet for bin:shift is still buggy, but I can try to fix it.</li>
<li>JWL: If the arrows are sufficiently variable across the browser, should we
make them images.</li>
</ul>
</div>
</div>
<div id="outline-container-pr-2286" class="outline-3">
<h3 id="pr-2286"><span class="section-number-3">2.4.</span> PR #2286: 2279 fn:string-length#1, fn:normalize-space#1: accept xs:anyAtomicType</h3>
<div class="outline-text-3" id="text-pr-2286">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2286">#2286</a>
</p>

<ul class="org-ul">
<li>CG: There has been a lot of discussion. Liam noted that <code>string-length()</code> and
<code>string-length(.)</code> do different things.
<ul class="org-ul">
<li>… Without an argument, the context item is “stringified”.</li>
<li>… But with an argument, it can only take strings.</li>
</ul></li>
<li>CG: But because of typed nodes, this not as easy as I thought.</li>
<li>CG: We could make the item type <code>xs:anyAtomicType</code> instead of <code>xs:string</code>.
<ul class="org-ul">
<li>… With this change, string length and normalize space would be similar to
other functions that accept the context item as the first item.</li>
</ul></li>
<li>JLO: I’m in favor. I think there’s a slight chance of misalignment because <code>.</code>
could be an array. Don’t they get atomized?
<ul class="org-ul">
<li>… But <code>xs:anyAtomicType</code> doesn’t allow that.</li>
</ul></li>
<li>CG: Arrays are going to be atomized. If that produces more than one string,
then you’ll get an error. I don’t think that changes.</li>
<li>JLO: I can pass that in even with <code>xs:anyAtomicType</code>?</li>
<li>MK: Yes, I think so.</li>
<li>JLO: Why is that in string length?</li>
<li>MK: That’s for typed nodes. If you pass in a name surrounded by spaces, the
current spec (since XPath 2.0) says that the string length is the length of
the string value of the node not the typed value. Those can be different.
<ul class="org-ul">
<li>… We’re retaining that compatibility.</li>
</ul></li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>

<p>
ACTION QT4CG-142-02: MK to add explanatory note about the difference between typed an untyped values in string-length
</p>
</div>
</div>
