meeting/minutes/2025/11-18.org
** PR #2285: 2198 Add pi-for-cdata parameter
:PROPERTIES:
:CUSTOM_ID: pr-2285
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2285][#2285]]

+ MK: This is a PR that just changes serialization, before going through all the other specs.
+ MK: This adds a new PI for CDATA section parameter that names a PI.
  + … The requirement was someone who wanted to generate only CDATA sections
    where they’re needed.
  + … I generalized that requirement to generate an arbitrary CDATA section
    anywhere a PI can occur.
+ NW: But putting data in a PI causes it to be lost by most down-stream processing.
  + … I strongly object.
+ JK: I don’t understand the name of the option. It sounds like a campaign slogan.
+ MK: It was intended to be an abbreviation for this the name of a processing
  instruction that you use for inserting cdata.
+ CG: When I first saw this issue, I had other use cases in mind.
  + … People want to have all text that uses special characters encoded.
  + … I’d prefer a solution that lets you do that dynamically.
  + … So maybe we have to use cases here, one where I want text explicitly
    escaped and another where I want that done more automatically.
+ WP: This cool in that it addresses a real requirement. I share NW’s
  hesitation. I think there are a couple of other possibilities. NW’s suggestion
  of a preceding PI would work. The other thing I wonder is, maybe there’s a way
  to flag an element with an attribute in namespace.
+ MK: You could maybe do something like we did for disable output escaping.
+ WP: I think there are a couple of options. I think NW’s concerns are well founded.
+ MK: Let’s try that one, putting an attribute on ~xsl:text~ that says CDATA section.
+ RD: It probably makes sense to have that be an XPath expression so you can
  call a function that makes that decision.
+ MK: Interesting.
+ JWL: RD’s suggestion would involve evaluating the function against the result.
+ RD: Yes, you’d get the string from the ~xsl:text~ or ~xsl:value-of~ and then pass
  that to the XPath expression.
+ JWL: The default value would be ~true()~ but you could put in a function.
+ MK: I think I can run with this.

** PR #2282: 2278 Add function bin:infer-encoding; simplify bin:decode-string
:PROPERTIES:
:CUSTOM_ID: pr-2282
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2282][#2282]]

+ MK: I was becoming unhappy with the complexity of ~fn:decode-string~. The
  interaction of skipping byte order marks and specifying offsets was getting
  very confusing.
  + … I wondered if we could get a cleaner design?
+ MK: What I’ve proposed is a function ~fn:infer-encoding~ that returns an
  encoding and an offset where the real data starts.
  + … So it might return “UTF-8” for the encoding and offset 3 if there’s a BOM.
  + … In particular it addresses the case where the binary is embedded in another stream.
  + … It simplifies ~bin:decode-string~ by saying it’s UTF-8 if you don’t specify it.
+ CG: I think the changes technically clean, but I have some concerns that where
  we started from was that we just had simple functions. One of my ideas was to
  try to make it easy for users who have maybe never heard of BOMs to be able to
  process data.
  + … It’s nice, but I would have liked a simpler solution for those users.
+ MK: We have ~fn:json-doc~ and ~fn:csv-doc~ and those do try to work out the encoding for you.
  + … But if you break it into steps, we now provide clean primitives.
+ CG: So you can write it to disk and read it back, but it’s probably easier to have a single function.
  + … Web applications and things like RESTXQ where you don’t want to decode the data on the fly.
+ JWL: In ~fn:decode-string~, my concern is that if I want to decode the string,
  if I don’t know what it is, isn’t there an argument saying that the default
  behavior should be to do an implicit infer?
+ MK: I think you end up with non-intutive behavior that way. Changing the
  offset from 0 to 1 changes the behavior that has nothing to do with the
  offset.

Some discussion of what the defaults should be and how they should interact.

+ JWL: If you only pass in a string, the ~fn:decode-string~ function should
  basically call the infer function. And if you provide an offset, that’s an
  offset in the real data.
  + … If I just want to decode a string and I don’t know anything about BOM, do
    I have to check?
+ MK: We could make it so that if there’s only one argument supplied it does that logic.
+ JWL: Does the offset I ask for in ~fn:decode-string~ include the chopped off BOM.
+ JLO: The binary module for me is always just a hex viewer. I want to be able
  to get each byte that I was given.
  + … I can see the possibility that I don’t want an inferred offset.
  + … I just want to see the raw data; or I really want to skip them but I don’t
    want to infer anything from them.
  + … And I can still see CG’s argument that we’d like it to be simple.
+ CG: In principle, I agree with JWL. I think it would be nice for the function
  to have a default behavior to infer the encoding.
  + … One other option would be to remove the offset and size. The question is
    when does it make sense to read data when you don’t know the encoding.
+ MK: Indeed, that problem is at the heart of this. Even if you have UTF-8 data,
  the specifying a start and byte position doesn’t make much sense given that
  the characters vary in length.
  + … You might have a message format that says how many octets each segment is. But…

Out of time. We’ll return to this next week.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

JWL: We’re going to try to put the tutorial material on the QT4CG website.

General nods of approval.
