meeting/minutes/2025/11-18.html
<div id="outline-container-pr-2285" class="outline-3">
<h3 id="pr-2285"><span class="section-number-3">2.5.</span> PR #2285: 2198 Add pi-for-cdata parameter</h3>
<div class="outline-text-3" id="text-pr-2285">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2285">#2285</a>
</p>

<ul class="org-ul">
<li>MK: This is a PR that just changes serialization, before going through all the other specs.</li>
<li>MK: This adds a new PI for CDATA section parameter that names a PI.
<ul class="org-ul">
<li>… The requirement was someone who wanted to generate only CDATA sections
where they’re needed.</li>
<li>… I generalized that requirement to generate an arbitrary CDATA section
anywhere a PI can occur.</li>
</ul></li>
<li>NW: But putting data in a PI causes it to be lost by most down-stream processing.
<ul class="org-ul">
<li>… I strongly object.</li>
</ul></li>
<li>JK: I don’t understand the name of the option. It sounds like a campaign slogan.</li>
<li>MK: It was intended to be an abbreviation for this the name of a processing
instruction that you use for inserting cdata.</li>
<li>CG: When I first saw this issue, I had other use cases in mind.
<ul class="org-ul">
<li>… People want to have all text that uses special characters encoded.</li>
<li>… I’d prefer a solution that lets you do that dynamically.</li>
<li>… So maybe we have to use cases here, one where I want text explicitly
escaped and another where I want that done more automatically.</li>
</ul></li>
<li>WP: This cool in that it addresses a real requirement. I share NW’s
hesitation. I think there are a couple of other possibilities. NW’s suggestion
of a preceding PI would work. The other thing I wonder is, maybe there’s a way
to flag an element with an attribute in namespace.</li>
<li>MK: You could maybe do something like we did for disable output escaping.</li>
<li>WP: I think there are a couple of options. I think NW’s concerns are well founded.</li>
<li>MK: Let’s try that one, putting an attribute on <code>xsl:text</code> that says CDATA section.</li>
<li>RD: It probably makes sense to have that be an XPath expression so you can
call a function that makes that decision.</li>
<li>MK: Interesting.</li>
<li>JWL: RD’s suggestion would involve evaluating the function against the result.</li>
<li>RD: Yes, you’d get the string from the <code>xsl:text</code> or <code>xsl:value-of</code> and then pass
that to the XPath expression.</li>
<li>JWL: The default value would be <code>true()</code> but you could put in a function.</li>
<li>MK: I think I can run with this.</li>
</ul>
</div>
</div>
<div id="outline-container-pr-2282" class="outline-3">
<h3 id="pr-2282"><span class="section-number-3">2.6.</span> PR #2282: 2278 Add function bin:infer-encoding; simplify bin:decode-string</h3>
<div class="outline-text-3" id="text-pr-2282">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2282">#2282</a>
</p>

<ul class="org-ul">
<li>MK: I was becoming unhappy with the complexity of <code>fn:decode-string</code>. The
interaction of skipping byte order marks and specifying offsets was getting
very confusing.
<ul class="org-ul">
<li>… I wondered if we could get a cleaner design?</li>
</ul></li>
<li>MK: What I’ve proposed is a function <code>fn:infer-encoding</code> that returns an
encoding and an offset where the real data starts.
<ul class="org-ul">
<li>… So it might return “UTF-8” for the encoding and offset 3 if there’s a BOM.</li>
<li>… In particular it addresses the case where the binary is embedded in another stream.</li>
<li>… It simplifies <code>bin:decode-string</code> by saying it’s UTF-8 if you don’t specify it.</li>
</ul></li>
<li>CG: I think the changes technically clean, but I have some concerns that where
we started from was that we just had simple functions. One of my ideas was to
try to make it easy for users who have maybe never heard of BOMs to be able to
process data.
<ul class="org-ul">
<li>… It’s nice, but I would have liked a simpler solution for those users.</li>
</ul></li>
<li>MK: We have <code>fn:json-doc</code> and <code>fn:csv-doc</code> and those do try to work out the encoding for you.
<ul class="org-ul">
<li>… But if you break it into steps, we now provide clean primitives.</li>
</ul></li>
<li>CG: So you can write it to disk and read it back, but it’s probably easier to have a single function.
<ul class="org-ul">
<li>… Web applications and things like RESTXQ where you don’t want to decode the data on the fly.</li>
</ul></li>
<li>JWL: In <code>fn:decode-string</code>, my concern is that if I want to decode the string,
if I don’t know what it is, isn’t there an argument saying that the default
behavior should be to do an implicit infer?</li>
<li>MK: I think you end up with non-intutive behavior that way. Changing the
offset from 0 to 1 changes the behavior that has nothing to do with the
offset.</li>
</ul>

<p>
Some discussion of what the defaults should be and how they should interact.
</p>

<ul class="org-ul">
<li>JWL: If you only pass in a string, the <code>fn:decode-string</code> function should
basically call the infer function. And if you provide an offset, that’s an
offset in the real data.
<ul class="org-ul">
<li>… If I just want to decode a string and I don’t know anything about BOM, do
I have to check?</li>
</ul></li>
<li>MK: We could make it so that if there’s only one argument supplied it does that logic.</li>
<li>JWL: Does the offset I ask for in <code>fn:decode-string</code> include the chopped off BOM.</li>
<li>JLO: The binary module for me is always just a hex viewer. I want to be able
to get each byte that I was given.
<ul class="org-ul">
<li>… I can see the possibility that I don’t want an inferred offset.</li>
<li>… I just want to see the raw data; or I really want to skip them but I don’t
want to infer anything from them.</li>
<li>… And I can still see CG’s argument that we’d like it to be simple.</li>
</ul></li>
<li>CG: In principle, I agree with JWL. I think it would be nice for the function
to have a default behavior to infer the encoding.
<ul class="org-ul">
<li>… One other option would be to remove the offset and size. The question is
when does it make sense to read data when you don’t know the encoding.</li>
</ul></li>
<li>MK: Indeed, that problem is at the heart of this. Even if you have UTF-8 data,
the specifying a start and byte position doesn’t make much sense given that
the characters vary in length.
<ul class="org-ul">
<li>… You might have a message format that says how many octets each segment is. But…</li>
</ul></li>
</ul>

<p>
Out of time. We’ll return to this next week.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
JWL: We’re going to try to put the tutorial material on the QT4CG website.
</p>

<p>
General nods of approval.
</p>
</div>
</div>
</div>
</body>
</html>
